import pyrogram
import asyncio
import requests
from pyrogram import Client as client
from pyrogram import Client, idle
from pyrogram import filters, Client
import random
from config import user, dev, call, logger, logger_mode, botname, appp
from CASERr.daty import get_call, get_userbot, get_dev, get_logger
from CASERr.CASERr import get_channel, devchannel, source, caes, johned
   
questions = {
    "ما هو عاصمة مصر؟": "القاهرة",
    "ما هو أطول نهر في العالم؟": "النيل",
    "ما هو عدد الكواكب في النظام الشمسي؟": "8",
    "ما هو لون الشمس؟": "أبيض",
    "اسمه من خمسة حروف اذا حذفت اوله بقا ثمان؟": "عثمان",
    "ما الشئ الذي يمتلك أسنان ولا يمكنه العض؟": "المشط",
    "شيء يتجمد إذا تم تسخينه؟": "البيض",
    "يحملك إلى اي مكان اذا حذفت اوله اصبح عظيم الشأن واذا حذفت اخره اصبح غالي الأثمان واذا عكسته تقشعر منه الأبدان؟": "درب",
    "نوع من أنواع الحيوانات يقوم بحك أذنه من خلال أنفه فما هو؟": "الفيل",
    "من هو خال ابن عمتك؟": "ابوك",
    "ما هو الشي الذي يعتبر غير نظيف اذا ابيض لونه؟": "اللسان",
    "ماهو الشيء الذي تراه ولا يراك؟": "الظل",
    "يطير مثل الطيور ولكنه لا يغادر مكانه؟": "العلم",
    "ماهو الشيء الذي لايقطع إلا اذا ادخلت اصابعك في عينيه؟": "المقص",
    "ما هو الشيء الذي يمر خلال الباب ولا يدخل؟": "المفتاح",
    "بيت لا يوجد له أبواب ولا نوافذ فما هو؟": "بيت الشعر",
    "ما هو الطائر الذي يستطيع تكرار كلام الإنسان بالتدريب؟": "الببغاء",
    "اين يوجد البحر الذي بدون ماء؟": "الخريطه",
    "لي رقبة وليس لدي رأس ولي ذراعين وليس لدي يدين ما هذا؟": "القميص",
    "ما الشخص الي يبدو بسيط لكن يحني له الملك رأسه؟": "الحلاق",
    "شيء اذا رايناه لا نركبه واذا ركبناه فلا نره فما هو؟": "النعش",
    "اوله ثالث تفاحة واخر التفاح ثانيه ورابع العمر له ثالث واخر الورد باقيه؟": "احمد",
    "من هو النبي الذي مات ولم يولد؟": "ادم",
    "شيء من الممكن ان يكون له خيال من الامام او الخلف ومن الممكن يكون بداخله؟": "الحفرة",
    "شيء يستطيع التحدث بكل لغات العالم؟": "صدى الصوت",
    "لا يبتل حتى وإن دخل الماء؟": "الضوء",
    "حيوان يمشي ويقف بالرغم من أنه ليس لديه أقدام؟": "الثعبان",
    "نوع من انواع الطيور يتكون من حرفين واذا قلبت الكلمة صارت اسم مهنة؟": "بط",
    "مدينة لا يطحن فيها الدقيق ولا يموت فيها الميت؟": "كل المدن",
    "ما هو الشيء الذي يعبر البحر دون أن يتبلل غير العجل في بطن أمه؟": "الطائره",
    "ماهو الشيء الذي يبكي اذا لففت راسه؟": "الحنفيه",
    "انا لا املك حياة ولكنني اموت فما اكون؟": "البطاريه",
    "ما هو الشيء الذي يطلبه الناس دائمًا وإذا جاء هربوا منه؟": "المطر",
    "فاكهة اسمها على اسم طائر؟": "الكيوي",
    "ما هو الجرح الذي لا ينزف دم في جسم الإنسان؟": "جرح المشاعر",
    "يطلع من بطن امه ويحك ظهر ابوه ويموت فما هو؟": "عود الكبريت",
    "ماهو الشيء الذي تأكل منه مع إنه لا يؤكل؟": "الصحن",
    "ماهو الشيء الذي نرميه بعد العصر؟": "البرتقال",
    "ما الاسم الذي إذا حذفت اوله صار اسمين؟": "ياسمين",
    "ماهو الشيء الذي يقرصك ولا تراه؟": "الجوع",
    "شيء موجود في الليل ثلاث مرات وفي النهار مرة واحدة؟": "حرف اللام",
    "ما هو الطائر الذي يستطيع تكرار كلام الإنسان بالتدريب؟": "حرف اللام",
    "كلما كان هناك المزيد قل ما تراه ما هذا؟": "الضباب",
    "ماهو الشيء الذي يسير ولا يمتلك أقدام؟": "الساعه",
    "يتم أخذها منك قبل أن تأخذها؟": "الصوره",
    "ماهو الشيء الذي يوجد وسط باريس؟": "حرف الراء",
    "هو اليف ولكن اذا صار بالأبيض والاسود صار متوحش فما يكون؟": "الحمار",
    "شيء تسمعه ولكن لا يسمعك تراه ولكن لا يراك؟": "التلفاز",
    "شئ قلبه ابيض ويرتدي قبعة خضراء لكن لونه اسود؟": "الباذنجان",
    "ماهو الشيء الذي له اعين ثلاث بينما له قدم واحدة؟": "اشارة المرور",
    "ما هو الحيوان الأبكم الذي لا يتكلم ولا نسمع له صوت؟": "الزرافه",
    "شيء اذا لمسته يصرخ؟": "الجرس",
    "انا املك كل المعلومات التي تعرفها وانا اصغر من قبضة يدك من اكون؟": "العقل",
    "ما هو الشيء الذي درجة حرارته ثابته سواء وضعته في الثلاجه أو على النار؟": "الفلفل",
    "ماهي الفاكهة الصلبة التي يوجد بداخلها حليب؟": "جوز الهند",
    "تاجر من التجار إذا اقتلعنا عينه طار فمن هو؟": "عطار",
    "ماهو الذي خلف الكلب اينما ذهب؟": "ذيله",
    "بلد إسلامي اوله عبادة واخره نقود فما هو؟": "الصومال",
    "ما هي الفاكهة التي تُجفف لتصبح زبيب؟": "العنب",
    "شيء يغلبك دون ان يؤذيك؟": "النوم",
    "ماهو الشيء الذي تشتريه لونه أسود ولكنك لاتستفيد منه إلا بعد أن يصبح لونه أحمر؟": "الفحم",
    "طوله حوالي شبر ويحمل أطول من متر ماهو؟": "الحذاء",
    "صغير الحجم لا تلقى له بال ولكن بوجهه تفتح الأبواب؟": "المفتاح",
    "ماهما الميتتان التي يجوز اكلهما بدون اثم؟": "السمك والجراد",
    "سيد وسيدة لديهما ست بنات وكل ابنة لها أخ واحد كم عدد أفراد العائلة؟": "تسعه",
    "إذا كان سعيد على يمين سمير وجابر على يمين سعيد فمن يكون في الوسط؟": "سعيد",
    "احمر وليس احمر اسود وليس اسود وابيض وليس ابيض ماهو؟": "البحر",
    "ان ابتسمت لها ابتسمت لك ماهي؟": "المراه",
    "ما هو أهون موجود و أعز مفقود؟": "الماء",
    "الشيء الذي إذا ذبح بكى عليه الجميع؟": "البصل",
    "من هو الشخص الذي يمشي على الأرض ولكنه يطول النجوم أيضًا؟": "الظابط",
    "إنسان وزوجته لا هو من بني آدم ولا هي من بنات حواء من هما؟": "ادم وحواء",
    "ما هو الشيء الذي يحمل طعامه فوق رأسه فإذا مشى أكل منه وإذا سكن غطى رأسه ونام؟": "قلم الحبر",
    "ما هو الشيء الذي يحيا في أول الشهر ويموت في آخر الشهر؟": "القمر",
    "ما الذي يمكنه أن يملأ الغرفة دون أن يشغل حيزا؟": "النور",
    "طائر إذا قمت بقلب حروف اسمه رأيت عجب؟": "بجع",
    "ينام بالحذاء ولا يخلعه؟": "الحصان",
    "ما هي الكلمة الوحيدة التي تلفظ غلط دائمًا؟": "غلط",
    "لا يبتل حتى وإن دخل الماء؟": "الضوء",
    "اسم حيوان اذا قمت بتغيير اول حرف منه اصبح اهم عضو في جسم الإنسان؟": "قلب",
    "ماهو الشئ الموجود في كل شيء؟": "الاسم",
    "امرأة عقيم هل تنجب ابنتها أطفال؟": "العقيم لا تلد",
    "ما هو الشئ الذي يمكن كسره دون ان نلمسه؟": "الوعد",
    "قلعة خضراء وأرضها حمراء وسكانها لونهم أسود فما هي؟": "البطيخه",
    "ماهو الذي خلف الكلب اينما ذهب؟": "ذيله",
    "ماهي الدولة التي حارب اهلها الذباب والعصافير لخطورتها؟": "الصين",
    "ما هي اسم الفاكهة التي سُميت بإحدى سور القرآن الكريم باسمها؟": "التين",
    "شيء كلما كان موجود كلما قل ماتراه؟": "الظلام",
    "عقرب لا يلدغ ولا يسبب الذعر لأي أحد حتى الأطفال؟": "عقرب الساعه",
    "فاكهة بها حبات اللؤلؤ؟": "الرمان",
    "شيء موجود في الدقيقة مرتين ولا يوجد في الساعة؟": "حرف القاف",
    "مدينة سعودية اسمها على اسم نبات فما هي؟": "عرعر",
    "ماهو الشيء الذي كلما عرضته للشمس ازداد بللا؟": "الثلج",
    "ما هو الشيء الذى كلما خطا خطوه فقد شيئًا من ذيله؟": "ابره الخياطه",
    "ماهو الشيء الذي يتحرك بدون أرجل ويبكي بدون عيون؟": "السحاب",
    "ما هو الشيء الذي بإمكانك تحقيقه دون بذل عناء؟": "الفشل",
    "شيء اذا اطعمناه لا يشبع واذا سقيناه يموت؟": "النار",
    "شيء ليس له بداية ولا نهاية ما هو هذا الشيء؟": "الدائره",
    "طائر يلد ولايبيض فما هو؟": "الخفاش",
    "شيء في السماء وليس في الماء فما هو؟": "حرف السين",
    "شيء تملكه انت ولكن يستخدمه الآخرون اكثر منك؟": "الاسم",
    "جزء من الجنة يعيش معنا في الأرض ما هو؟": "الحجر الاسود",
    "يمتلك بحيرات بلا ماء وأراضي بلا زرع وجبال بلا أحجار؟": "الخريطه",
    "اي كلمة تصبح اقصر اذا اضفت لها حرف؟": "قصر",
    "ما هي درجة القرابة طفل من والده الحقيقي لكن هذا الطفل ليس ابنه؟": "ابنته",
    "ماهو الشجر الذي يسميه الناس قاتل ابيه؟": "الموز",
    "شيء يمكن قياسه لكن لايمكن رؤيته؟": "الوقت",
    "ماهو الشيء الذي ينام ولا يقوم؟": "الرماد",
    "شيء يمشي أمامك ولا تستطيع رؤيته؟": "المستقبل",
    "شهر هجري اذا حذفت وسطه يتحول الي فاكهة؟": "رمضان", 
    "هو شيء يكون لونه أخضر في الأرض وأسود في الأسواق وأحمر في الأكواب، فما هو؟": "الشاي",
    "يمكنه رفع الأثقال، لكنه لا يستطيع أن يمسك مسمار": "البحر",
    "يقول الحقيقة ويكذب عندما يكون جائعا": "الساعه"
    
}

correct_answers = {}

@Client.on_message(filters.command(["فزوره", "لغز"], ""), group=753)
async def ask_question(client, message):
    if await johned(client, message):
     return
    bot_username = client.me.username
    question = random.choice(list(questions.keys()))
    correct_answer = questions[question]
    await message.reply(question)
    correct_answers[message.chat.id] = correct_answer

@Client.on_message(filters.text, group=753)
async def check_answer(client, message):
    bot_username = client.me.username
    if message.chat.id in correct_answers:
        correct_answer = correct_answers[message.chat.id]
        user_answer = message.text
        if user_answer.title() == correct_answer.title():
            await message.reply("احسنت الاجباه صحيحه ✨♥")
        else:
            await message.reply(f"الاجباه خطا 😔💔 الاجابه الصح هي:[{correct_answer}] ")
        del correct_answers[message.chat.id]        